# Функция расстояния на сферической поверхности
function get_distance(
    # Первая точка (долг, шир)
    x1::Float64, y1::Float64,
    # Вторая точка (долг, шир)
    x2::Float64, y2::Float64
)
    # Радиус Земли
    R = 6371e3 # в метрах
    φ1 = y1 * π / 180 # в радианах
    φ2 = y2 * π / 180;
    Δφ = (y2 - y1) * π / 180;
    Δλ = (x2 - x1) * π / 180;

    a = sin(Δφ / 2) * sin(Δφ / 2) + cos(φ1) * cos(φ2) * sin(Δλ / 2) * sin(Δλ / 2)

    return R * 2 * atan(sqrt(a), sqrt(1 - a)) # в метрах
end
